---
layout: default
title: TIL - Today I've Learned
use_math: true
---
# Today I've learned

## 19 June 2019

I was discussing endianess with a colleague and realized that I had  a fuzzy idea about why there are little-endian and big-endian systems. A quick search led me to Danny Cohens [On Holy Wars and a Plea for Peace](https://tools.ietf.org/rfc/ien/ien137.txt) that introduced the endianess concept.

## 17 June 2019

A process under Linux has an upper limit on number of allowed open file descriptors. Finding a reliable way to read out the highest open file descriptor has turned out to be a bit of a challenge. There is the `OPEN_MAX` define but it is set at compile time - the system can change the limit at runtime. Using `sysconf(_SC_OPEN_MAX)` gives a value that may be too high if `setrlimit(RT_NOFILE)` has set a lower value.  And on some systems `sysconf` just return `INT_MAX` .You can iterate over the symbolic links in `/proc/self/fd/` but `proc` is not guaranteed to be mounted in a `chroot` environment for example. 

## 14 June 2019

Here's a small script written by Rob Landley for listing functions in a binary and for printing the disassembly of a chosen function. I've added options to `objdump` for printing in Intel syntax; showing in C++ symbols in plain-text; and for printing relocation entries.

```
[ $# -lt 1 ] || [ $# -gt 2 ] && { echo "usage: showasm file function"; exit 1; }
[ ! -f $1 ] && { echo "File $1 not found"; exit 1; }
if [ $# -eq 1 ]
then

An alternative to placing the firmware file under /lib/firmware is to include it into the kernel, thereby speeding up the loading phase at the expense of a larger kernel image. If the driver that requires the firmware is built into the kernel, then you should place the firmware image in the initramfs as well, to avoid races with root file-system mounting during upstart.

## 12 September 2018

I had built an image using the Yocto build system but when I booted it, a USB module was not detected by a driver I had assumed had been built. How do you figure out if a certain driver has been built or not? Either you search the `/lib/modules/$(uname -r)/` directory if it was built as a module. Or you can search in the `/lib/modules/$(uname -r)/modules.builtin` file. But the easiest way is probably to use `modinfo` which does both for you. One thing you can not rely on is the content of `/sys/module/`: only standalone modules or builtin modules that takes parameters are listed there.

## 5 September 2018

According to the Unix&Linux StackExchange post [USB C to Displayport driver support](https://unix.stackexchange.com/questions/403318/usb-c-%E2%86%92-displayport-adapter-support), I'll have to wait until kernel 4.19 before the kernel can support my Displayport to USB C adapter. The good news is that the driver will support every cable present on the market.

## 4 September 2018

When I've  edited files whose names was piped to  `vim` using `find -name pattern | xargs vim` , the terminal has gotten borked afterwards. Today I learned from the Stackexchange question [Invoking vi through xargs - vi breaks my terminal, why](https://superuser.com/questions/336016/invoking-vi-through-find-xargs-breaks-my-terminal-why) that when you invoke a program via `xargs`, the programs stdin points to `/dev/null` (since xargs doesn't know the original stdin, it does the next best thing).  Vim reads the tty settings from `/dev/null` and later applies those to its controlling terminal when exiting. A solution to this problem is to invoke `xargs` with the `-o, --open-tty` option, which will reopen `/dev/tty` as stdin.

## 29 August 2018

Today a colleague asked why a `struct` containing five `uint8_t` members occupied 8 bytes instead of 5 bytes. For code involving structures, the compiler may need to insert gaps in the field allocation to ensure that  each structure member satisfies its alignment requirement. But `uint8_t` can be aligned on each byte boundary. What's going on?

The thing to know about bit-fields is that they are implemented with word- and byte-level mask and rotate instructions operating on machine words, and cannot cross word boundaries. The compiler will try to pack the bit-fields as tightly as possible, but it won't cross word boundaries

```
struct S {
  char c[3];
  char c4 :5;
  char c5 :5;
  char c6 :5;
};

int main(int argc, char *argv[]) {
  return sizeof(struct S);
}
```

Clangs diagnostic command shows this layout on my Linux x64 laptop. Note that the size is 6 instead of 5 bytes.

```
*** Dumping AST Record Layout
         0 | struct S
         0 |   char [3] c
     3:0-4 |   char c4
     4:0-4 |   char c5
     5:0-4 |   char c6
           | [sizeof=6, align=1]
```

But that's not the whole story. The compiler we use added padding to structs containing bitfields so that the total size woul be a multiple of the wordsize.

## 27 August 2018

I was trying to boot a board from  a regular Debian image at work today and the kernel got blocked on MMC-readings. In the logs there were lines with the text `INFO: task kworker/3:1:79 blocked for more than 120 seconds`, followed by a back-trace for the specific kernel thread. I've seen those messages in the past for different reasons. Now I got curious about which part of the kernel is responsible for printing them.

The file [kernel/hung_task.c](https://elixir.bootlin.com/linux/latest/source/kernel/hung_task.c) creates the `khungtaskd` thread which gets scheduled every 120 seconds and checks if each task that is in interruptible sleep has been scheduled for the last 120 seconds. If it hasn't, then `khungtaskd` dumps the hung tasks call stack. This kernel code is easy to explain, but there's still a couple of details that are fiddle, such as guaranteeing an upper bound on the number of tasks that are traversed and ensuring that the RCU lock is not held for too long, and updating the timeout values in an atomic fashion.

## 23 August 2018

I tried to solve the [Chain Matrix Multiplication problem](https://en.wikipedia.org/wiki/Matrix_chain_multiplication) and wow that was a challenge for me. The earlier DP problems I've solved has involved linear recursion in one or two dimensions, but this problem requires tree recursion. But just understanding matrix multiplication was a chore. I've never taken a linear algebra course and it shows. [Kalid Azads article An Intuitive Guide to Linear Algebra](https://betterexplained.com/articles/linear-algebra-guide/) explains matrix multiplication as that a matrix can either consist of data (organized in columns) or operations (organized in rows). When we multiply two matrices, he imagines it as if we're "pouring" the input data through the operations matrix to create the result. It's easier to understand if you see his illustrations.

The Chain Matrix Multiplication problem is about placing parenthesis for optimizing the order in which we perform the calculations. Those parenthesized expressions makes up a tree and the objective is to construct an optimal tree from subtrees.

```
@memo
def chain_matrix_mult(M):
    def C(i, j):
        if i == j: return 0
        return min([C(i, k) + C(k+1,j) + M[i-1] * M[k] * M[j] for k in range(i, j)])
    return C(1, len(M)-1)
```

## 22 August 2018

Dynamic programming solutions often has two dimensional arrays and the expressions gets hard to read with all the nesting of the bracket operators, `table[i][j]=table[i][j-1]`. [Numpy](http://www.numpy.org/) arrays allows me to use two indexes inside the brackets which cleans up the the code, `table[i, j] = table[i, j-1]`.

```
import numpy as np
def Table(num_rows, num_cols):
	return np.zeros((num_rows, num_cols), dtype=np.int)
```

Here's a solution for  Knapsack without repetitions.

```
def knapsack(items, W):
	N = len(items)
	K = Table(N+1, W+1)
	for  i in range(1, W+1):
		for j in range(1, N+1):
			v, w = items[i-1]
			if w > W:
				K[i, j] = K[i, j-1]
			else:
				K[i, j] = max(K[i, j-1], v + K[i-w, j-1])
	return K[W, N]
```

## 21 August 2018

Dasgupta et.al. writes that every dynamic programming problem has an underlying DAG structure: each node represents a subproblem and each edge represents a precedence constraint on the order in which the subproblems can be tackled. I don't know if that will help me in the  future when I try to solve DP problems, but I guess it's worth to keep in mind. I solved the Knapsack with Repetition problem. You're allowed to take several items of the same kind. You can solve that problem by recursing on the max allowed weight `Ẁ`.

```
@memo
def knapsack(values, weights, W):
	if W == 0: return 0
	return max([v + knapsack(values, weights, W - w) 
		for v, w in zip(values, weights) if w <= W] or [0])
```

 It took some head scratching before I had convinced myself that the algorithm is correct. But once I had done that and had written the top-down version, then writing the bottom-up code was easy. I feel like I'm finally making progress. Yay!

```
def knapsack(values, weights, W): 
	K = [0] * (W+1)
	for i in range(1, W+1):
	K[i] = max([v + K[i-w] for v, w in zip(values, weights) if w <= i] or [K[i-1]])
	return K[W]
```

## 18 August 2018

Brian Deans [Dynamic Programming Practice Problems](https://people.cs.clemson.edu/~bcdean/dp_practice/) contains descriptions of a couple of common DP problems and has short recordings which shows Brian solving them using intuitive table descriptions. Might be worth investigating. By now I've spent a little too much time trying to get an orientation on what dynamic programming really is. The central concepts are recursive definitions and the tables with data flows. I probably just need to work through the examples in CRLS and Dasgupta to get a good grasp on those fundamentals.

## 17 August 2018

Edward Z. Yang writes in [DP Zoo Tour](http://blog.ezyang.com/2010/11/dp-zoo-tour/) that you can almost completely characterize a dynamic programming algorithm by the shape of its table and how the data flows from one cell to another. He has collected a bunch of algorithms from Introduction to Algorithms and drawn up the tables and data flows. I especially liked the arrow notation he used for describing data flow.  The Longest Increasing SubSequence problem (LIS) and knapsack with repepetion has dataflow dependencies on all previous cells. Just seeing the arrows made it much easier for me to reason about those.

## 16 August 2018

Steven Skiena writes that learning Dynamic Programming (DP) requires that you see  a lot of solved exercises before "it clicks" and you understand how to do them yourself. Well, there's been no "clicking" for me yet! 

The [Longest Increasing Subsequence problem](https://en.wikipedia.org/wiki/Longest_increasing_subsequence) (LIS) is one of the first DP problems that one gets introduced to. It can be viewed as finding the longest path through the directed graph of all permissible transitions! I wrote a recursive version that recurses on both `i` and `j` . I tried replacing the `j` recursion with a for loop but failed. I've noticed that even though I have  a recursive relation for a sequence, I'm still having trouble with implementing it in code.

```
def lis(X):
	@memo
	def _lis(i, j):
		if i == 0: return 1
		if j < 0: return 0
		m = 1 + _lis(i-1, i-2) if X[i] > X[j] else 0
		return max(m, _lis(i, j-1))
	return _lis(len(X)-1, len(X)-2)
```

The recursive version recurses from right to left. I then wrote a bottom-up solution that goes from left to right. Many of the DP problems assumes there's an inherent left-to-right ordering. For bottom-up you have to figure out what the search space is. For LIS, it's a table of i * j but here we only store the max of each column of that table in `L`.

```
def lis(X):
	L = [0] * len(X)
	for i, x in enumerate(X):
	L[i] = max([y for j, y in enumerate(L[:i]) if X[j] < x] + [0]) + 1
	return max(L)
```

The [Longest Common Subsequence problem](https://en.wikipedia.org/wiki/Longest_common_subsequence_problem) (LCS) is a problem I've wanted to understand for a long time. I've written patch and diff programs in the past but they've relied on already implemented LCS algorithms. The recursive relation can be easily written in python.

```
@memo
def lcs(X, Y):
	if len(X) == 0 or len(Y) == 0:
		return 0
	if X[0] == Y[0]:
		return 1 + lcs(X[1:], Y[1:])
	return max(lcs(X[1:], Y), lcs(X, Y[1:]))
```

The iterative version can be done with a two dimensional table just like the LIS solution. Each coordinate (i, j) in that table represents the LCS for `X[:i]` and `Y[i:]`. 

```
def lcs(X, Y):
	N, M = len(X), len(Y)
	L = [[0] * (M+1) for _ in range(N+1)]
	for i in range(N+1):
		for j in range(M+1):
			if i == 0 or j == 0:
				L[i][j] = 0
			elif X[i-1] == Y[j-1]:
				L[i][j] = L[i-1][j-1] + 1
			else:
				L[i][j] = max(L[i-1][j], L[i][j-1])
	return L[N][M]
```

## 14 August 2018

The [Discrete Optimization](https://www.coursera.org/learn/discrete-optimization) course covers [dynamic programming](https://en.wikipedia.org/wiki/Dynamic_programming), [constraint programming](https://en.wikipedia.org/wiki/Constraint_programming), [linear programming](https://en.wikipedia.org/wiki/Linear_programming) and and [local search](https://en.wikipedia.org/wiki/Local_search_%28optimization%29). The lectures are somewhat chatty and unorganized. I'll probably need to read some books while going through the material.

Dynamic programming is covered in all my algorithm books: CRLS, Skiena, Dasgupta and Kleinberg&Tardos. Linear programming is covered in CRLS, Dasgupta, Tardos and on a high-level in Skiena. There is a local search chapter in Kleinberg&Tardos. For constraint programming the best resource I've found so far is Roman Bartaks [Online Guide to Constraint Programming](http://kti.ms.mff.cuni.cz/~bartak/constraints/index.html) and Peter Norvigs book [Artifical Intelligense a Modern Approach](http://aima.cs.berkeley.edu/).

David P. Williamsson and David B. Shmoys book [The Design of Approximation Algorithms](http://www.designofapproxalgs.com/) seems to cover a lot of the material for the course as well.

## 12 August 2018

While doing some dynamic programming exercises involving the calculation of [Bell numbers](https://en.wikipedia.org/wiki/Bell_number) and [Binomial coefficients](https://en.wikipedia.org/wiki/Binomial_coefficient) I noticed that the recursive definitions  for Stirling numbers and Binomial coefficients very much resemble each other. Here is the definition for Stirling numbers:

```
S(n, k) = S(n-1, k-1) + k * S(n-1, k)
S(n, 1) = S(n, n) = 1
```

`S(n, 1)` means putting n items in one pile. That can only be done in one way, and `S(n, n)` means putting n items on n piles. That can also only be done in one way. If `1 < k <n` then we can either create a new pile `S(n-1, k-1)` or put the item on one of the existing piles `k * S(n-1, k)`.

And here is the definition for Binomial Coefficients:

```
C(n, k) = C(n-1, k-1) + C(n-1, k)
C(n, 0) = C(n, n) = 1
```

## 11 August 2018

Today in the [Discrete Optimization](https://www.coursera.org/learn/discrete-optimization) course I learned about [dynamic programming](https://en.wikipedia.org/wiki/Dynamic_programming) (DP).  A problem must have overlapping subproblems and optimal subproblems must lead to the optimal solution in order for dynamic programming to be applicable. They can either be solved via a bottom-up or a top-down approach. Let's solve the most typical DP problem: Fibonacci numbers. They can be calculated using a  slow recursive algorithm. We can speed it up by adding memoization to avoid recomputing the overlapping subproblems.

```
def fib_naive(n):
	if n < 2:
		return n
	return fib_naive(n-1) + fib_naive(n-2)

@memo
def fib_memo(n):
	if n < 2:
		return n
	return fib_memo(n-1) + fib_memo(n-2)
```

Even with memoization there's still a lot of  recursive calls. If we use a bottom-up approach we can get rid of the recursion.

```
def fib_tabular(n):
	table = [0] * (n+1)
	table[1] = 1
	for i in range(2, n+1):
		table[i] = table[i-1] + table[i-2]
	return table[n]
```

One thing to keep an eye for with dynamic programming is the size of the tables required. Here we can see that we only need the two previous Fibonacci numbers to calculate the next one.

```
def fib_tabular_optimized(n):
	a, b = 0, 1
	for _ in range(2, n+1):
		a, b = b, a + b
	return b
```

Figuring out how to express the problem as a recurrence relation appears to be the hardest step in solving a DP problem. Nikola Otasevic has a good explanation of that thought process in [Dynamic Programming - 7 steps to solve any DP interview problem](http://blog.refdash.com/dynamic-programming-tutorial-example/).

## 10 August 2018

I signed up for [Pascal Van Henterycks Coursera course Discrete Optimization](https://www.coursera.org/learn/discrete-optimizationhttps://www.coursera.org/learn/discrete-optimization).  He started with a motivating example where Indiana Jones was trying to fill a knapsack with precious art items. Using a greedy algorithm, I can select the items by max value, max weight or by max value-weight density. But none of those three approaches led to the optimal solution. That was an eye opener. 

```
items_by_worth = sorted(items, key=lambda x: x.value, reverse=True)
items_by_weight = sorted(items, key=lambda x: x.weight)
items_by_density = sorted(items, key=lambda x: x.value/x.weight, reverse=True)

def fill_knapsack(seq, capacity=10):
	weight = 0
	sack = []
	for elt in seq:
	if weight + elt.weight <= capacity:
		sack.append(elt)
		weight += elt.weight
	return sack, sum(x.value for x in sack)
```

Pascal said that you should start with a greedy approach. It's often easy to code, but seldom closest to the optimal solution. I can always find the optimal solution using brute force, but that has exponential running time.

```
max((fill_knapsack(x) for x in permutations(items)), key=lambda x: x[1])
```

## 6 July 2018

I watched [Bitwise Day 43, Domain Specific Languages in Python](https://bitwise.handmade.network/episode/bitwise/bitwise043/). There Per describes how you can create an embedded DSL inside Python. I learned that many things can be overloaded in Python, but the logical operators cannot. If you call `or`, `and` or `not` on an object then it will convert that object to a boolean by calling `__bool__`. If that operator is not defined then it uses `__len__` and if that is not implemented it converts the object to `True`.

```
class Node:
   def __and__(self, other):
		return Node()
	def __bool__(self):
		raise TypeError("Cannot treat nodes as logical values")
x, y = Node(), Node()
z = x & y
z = x and y
```

Another thing is that Python provides special operators for the reverse ordering of arguments. So `x & 1` will work for the code above, but `1 & x` will raise a `TypeError`. By adding a `__rand__` overload, the code will work as intended. What happens under the hood is that the int `__and__` operator gets called and throws and exception, that is caught by the runtime and it tries the left hand side `__rand__` operator instead.

A cool thing about Python is that everything is an object, even types are objects. Per uses that for his interpreter where he does a lookup on the type in a dictionary. Here's a simplified example of his code to show the idea:

```
evaluators = {
	int : lambda x : x,
	str : lambda x : len(x)
}
def evaluate(x): return evaluators[type(x)](x)
```

So `evaluate(42)` will return 42 and `evaluate("hello world")` will return 11.

## 5 July 2018

I read [Michael Nielsens essay Augmenting Long-Term Memory](http://augmentingcognition.com/ltm.html) wherein he describes his experiences of using a "Personal Memory System", here [the software Anki](https://apps.ankiweb.net/), which is a computerized flashcard program that automatically manages the review schedule. Michael mentions concepts that I recognize from taking [Barbara Oakleys online course Learning How to Learn](https://www.coursera.org/learn/learning-how-to-learn), like spaced repetition; the value in memorizing the basics; how different memories are triggered by small variations of cues; and chunking and making connections between chunks. What was new to me was Michaels view that Anki helps him to form better chunks by forcing him to create "atomic" question-answer pairs that are then easier to combine. He sees Anki as not just a system for remembering simple facts, but a way to build up arbitrary complex knowledge. He also describes how "Ankifying" information in a paper by doing several passes and write questions for things  he's learned has helped him to absorb information more quickly.

## 4 July 2018

Object layout for C++ classes can be inspected with the same clang options as I used yesterday. Here is a class hierarchy without inheritance:

```
class Base {
public:
  int x;
};

class Derived : public Base {
  public:
    int y;
};
```

Clang shows the following data layout for Derived:

```
*** Dumping AST Record Layout
         0 | class Derived
         0 |   class Base (base)
         0 |     int x
         4 |   int y
           | [sizeof=8, dsize=8, align=4,
           |  nvsize=8, nvalign=4]
```

If I add a virtual member function to `Base` and `Derived` then a vtable is inserted at the beginning of the object.

```
*** Dumping AST Record Layout
         0 | class Derived
         0 |   class Base (primary base)
         0 |     (Base vtable pointer)
         8 |     int x
        12 |   int y
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]
```

## 3 July 2018

I got confused about how alignment works in C and wrote this small experiment.

```
struct E { _Alignas(16) char c; };

struct P1 { int i; char c; int j; char d; };
struct P2 { int i; char c; char d; int j; };
struct P3 { short w[3]; char c[3]; };
struct P4 { short w[3]; char *c[3]; };
struct P5 { struct P1 a[2]; struct P2 *p; };
struct P6 { struct E a[3]; };

int main(int argc, char *argv[])
{
  int r = 0;
  r += sizeof(struct P1);
  r += sizeof(struct P2);
  r += sizeof(struct P3);
  r += sizeof(struct P4);
  r += sizeof(struct P5);
  r += sizeof(struct P5);
  r += sizeof(struct P6);

  return r;
}
```

Linux requires that a type of K bytes must be aligned on a K-byte boundary. For compound types, this means that padding may be required between members or after the last member. The `_Alignas` directive can be useful for dictating stricter alignment, for example when using DMA buffers.

Eli Bendersky shows in [Dumping a C++ objects memory layout with Clang](https://eli.thegreenplace.net/2012/12/17/dumping-a-c-objects-memory-layout-with-clang/) how clangs cc1 frontend has a -f command that can be used for inspecting the memory layout. Here is the output for the test cases above.  `P1` has tail padding added.  `P3.c` starts at offset 6, while `P4.c` starts at offset 8: the member with largest alignment dictates how the other members will be laid out.

```
$ clang -cc1 -fdump-record-layouts test.c
*** Dumping AST Record Layout
         0 | struct P1
         0 |   int i
         4 |   char c
         8 |   int j
        12 |   char d
           | [sizeof=16, align=4]

*** Dumping AST Record Layout
         0 | struct E
         0 |   char c
           | [sizeof=16, align=16]

*** Dumping AST Record Layout
         0 | struct P2
         0 |   int i
         4 |   char c
         5 |   char d
         8 |   int j
           | [sizeof=12, align=4]

*** Dumping AST Record Layout
         0 | struct P3
         0 |   short [3] w
         6 |   char [3] c
           | [sizeof=10, align=2]

*** Dumping AST Record Layout
         0 | struct P4
         0 |   short [3] w
         8 |   char *[3] c
           | [sizeof=32, align=8]

*** Dumping AST Record Layout
         0 | struct P5
         0 |   struct P1 [2] a
        32 |   struct P2 * p
           | [sizeof=40, align=8]

*** Dumping AST Record Layout
         0 | struct P6
         0 |   struct E [3] a
           | [sizeof=48, align=16]
```



## 16 June 2018

Simon Tatham describes in [Coroutines in C](https://www.chiark.greenend.org.uk/~sgtatham/coroutines.html) how a coroutine can be implemented by using a variant of Duffs Device. The limitations is that it can't yield from inside a called function and there can't be multiple active coroutines for the same function.

```
int function(void) {
    static int i, state = 0;
    switch (state) {
        case 0: /* start of function */
        for (i = 0; i < 10; i++) {
            state = 1; /* so we will come back to "case 1" */
            return i;
            case 1:; /* resume control straight after the return */
        }
    }
}
```

Adam Dunkels describes in [Protothreads under the hood](http://dunkels.com/adam/pt/expansion.html) how PT overcome the "only one active coroutine" limitation by having the state variable `pt` be a parameter. But it's still a stackless coroutine.

```
struct pt { unsigned short lc; };
